{
    "books": [
        {
            "id": "bpfcDgAAQBAJ",
            "title": "Web Application Development with MEAN",
            "authors": [
                "Amos Q. Haviv",
                "Adrian Mejia",
                "Robert Onodi"
            ],
            "publisher": "Packt Publishing Ltd",
            "publishedDate": "2016-10-28",
            "description": "Unlock the power of the MEAN stack by creating attractive and real-world projects About This Book Learn about the different components that comprise a MEAN application to construct a fully functional MEAN application using the best third-party modules A step-by-step guide to developing the MEAN stack components from scratch to achieve maximum flexibility when building an e-commerce application Build optimum end-to-end web applications using the MEAN stack",
            "categories": [
                "Computers"
            ],
            "imageLink": "http://books.google.com/books/content?id=bpfcDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": "Ksh. 4800"
        },
        {
            "id": "FT6j3YMDhNYC",
            "title": "Professional LINQ",
            "authors": [
                "Scott Klein"
            ],
            "publisher": "John Wiley & Sons",
            "publishedDate": "2008-01-22",
            "description": "Professional LINQ introduces experienced programmers and database developers to LINQ database queries in their native VB and C# languages. Some of the topics covered include: LINQ Queries LINQ and the Standard Query Operators Programming with XLinq Querying XML with XLinq Mixing XML and other data models DLinq and Queries LINQ over datasets Interoperating with ADO.NET LINQ and ASP.NET",
            "categories": [
                "Computers"
            ],
            "imageLink": "http://books.google.com/books/content?id=FT6j3YMDhNYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": "Ksh. 3200"
        },



        {
            "id": "EfEOAAAAYAAJ",
            "title": "The Magazine of History, with Notes and Queries",
            "authors":[
                "Anon Sohala"
            ],
            "publisher": "Excel Publishing",
            "publishedDate": "1917",
            "description": "This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work.",
            "categories": [
                "History"
                ],
            "imageLink": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTelt_Xp1doG5lLngg5l-ewMKc7CHgJyu_WXQ&s",
            "price": "KSh. 3000"
        },
        {
            "id": "CY98qQNHOl4C",
            "title": "Understanding Directory Services",
            "authors": [
                "Beth Sheresh",
                "Doug Sheresh"
              ],
            "publisher": "Sams Publishing",
            "publishedDate": "2002",
            "description": "Book Description Understanding Directory Servicesclarifies the complex topic of directory services, starting with basic theory and archetypes, and then working its way up to the current directory service implementations. It describes the basic idea behind directory services, explaining the underlying conceptual models, design characteristics, and methods of managing distributed information. The book begins with an overview of directory services and their core characteristics, highlighting critical aspects of directory information, distribution, and storage. The evolving nature of the information the directory contains, and the factors involved in organizing and managing it are discussed in detail, and then methods of information distribution and storage are examined at length. After exploring the basics of directory service, the book progresses to in-depth chapters on each of the critical technologies being used to implement directory services: * The X.500standards are explained to help you understand the foundations of directory services and provide a basis for comparison of the other directory technologies. *Lightweight Directory Access Protocol(LDAP) and its emerging role as a directory access standard is described in detail, with thorough explanations of models, naming, and operations. *The Domain Name System(DNS) is examined from a directory service perspective, noting parallels in structures and operations. This knowledge of directory services is then used to describe the design of X.500 and LDAP based directory service products, as well as NDS eDirectory and Active Directory, highlighting the architectural and operational implications of vendor's design decisions. This book: * Explores X.500-based directory products (eTrust, DirX, Nexor), and highlights implementation approaches and capabilities. * Describes the LDAP-based directory products (OpenLDAP, SecureWay, iPlanet), identifying similarities and differences between them. * ExplainsNDS eDirectorydescribing the underlying directory architecture and its foundations in X.500, and its evolution from an NOS-based directory to a general purpose directory service. * Examines howActive Directoryintegrates NT 4, LDAP, and DNS technologies into a directory service that leverages established Windows networks. * Explores the information management issues that meta-directories (Siemens DirXmetahub, iPlanet meta-directory, Microsoft Meta-directory Services, Novell DirXML) are designed to address, and characteristics of different types of meta-directory solutions (as well as Radiant Logic'sRadiant Onevirtual directory server). * Identifies the design of XML-based directory markup languages that map directory schema, objects, and operations providing directory interoperability. The final chapter is focused on helping you evaluate directory services in the context of your business and network environment. Information, business, and network control factors are identified, and key factors in directory service assessment are explained. Understanding Directory Servicesis an excellent reference for directory service technologies that includes extensive references and aglossarycontaining 385 directory service terms. By explaining key directory technologies, and the integration of those technologies, this book provides the information you need to understand the design and operations involved in all directory services. From the Back Cover Understanding Directory Servicesis the most in-depth resource available on directory services theory, architecture, and design. It provides the conceptual framework and critical technical information for IT professionals who are using directory services in their networks or e-business solutions. The 1st edition of this book covered the underlying directory service technologies (X.500, LDAP, DNS), and integrated the information from a networking perspective with a special focus on eDirectory and Active Directory. The 2nd Edition extends this coverage to the LDAP-based directories (such as iPlanet and SecureWay) and the X.500-based enterprise directory services (including eTrust, DirX, and Nexor), as well as the emerging meta-directory technologies and products which are crucial to the integration of the multiple directories in an enterprise networking environment. By explaining the origins and technologies of directory services, and clarifying the integration of key directory technologies into network and e-commerce platforms,Understanding Directory Servicesgives you the information you need to understand the underlying design and operations involved in all directory services. Reviews of the first edition Warren E. Wyrostek -- MCP Magazine ...superb, comprehensive...highly recommend it to all network professionals...a must read for anyone wrestling with deploying a directory service... Douglas Ludens -- About.com ...clearly organized and well written...a great book, I highly recommend it...essential to doing well with Windows 2000...",
            "categories": [
                    "Computers"
                ],
            "imageLink": "http://books.google.com/books/content?id=CY98qQNHOl4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": "KSh. 2500"
        },

        {
            "id": "SDvvndSmG_YC",
            "title": "Successful ICT Projects in Access",
            "authors": [
            "P. M. Heathcote",
            "Bonie Ngowi"
            ],
            "publisher": "Payne Gallway",
            "publishedDate": "2002",
            "description": "This book offers practical advice and strategies for successful implementation of Internet .Computing Technology (ICT) projects in schools, businesses, and government agencies. It covers various aspects of .ICT, including project planning, budgeting, staff training, and monitoring, as well as strategies for collaboration and communication among team members.",

            "categories": [
            "Computers"
            ],
            "imageLink": "http://books.google.com/books/content?id=SDvvndSmG_YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            
            "price": "Kshs.1200"
            },
            {
            "id": "UUADAAAAYAAJ",
            "title": "Scottish Notes and Queries",
            "authors": ["Jakoyundi"],
            "publisher": "Scribner",
            "publishedDate": "1888",
            "description": "This comprehensive guide delves into the fascinating world of family history,offering practical tools and techniques for tracing your ancestry. Whether you're a beginner or an experienced researcher, this book provides valuable insights into uncovering your roots, preserving family stories, and understanding the connections that shape your heritage.",
            
            "categories": [
            "Genealogy"
            ],
            "imageLink": "http://books.google.com/books/content?id=UUADAAAAYAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
            "price": "Kshs.1200"
            },

            {
                "id": "-LtAAQAAMAAJ",
                "title": "The China Review, Or, Notes and Queries on the Far East",
                "authors": [
                    "Nicholas Belfield Dennys",
                    "Ernest John Eitel",
                    "William C. Barlow",
                    "James Dyer Ball"
                ],
                "publisher": " Hongkong : China Mail Office",
                "publishedDate": "1874",
                "description": "The China Review, Or, Notes and Queries on the Far East was an academic journal published in Hong Kong from 1872 to 1901, primarily focused on scholarly writings about China by foreign scholars living on the Chinese coast, covering topics like arts, sciences, ethnology, folklore, geography, history, literature, mythology, customs, natural history, and religion across the broader Far East region including Japan, Mongolia, Tibet, and the Eastern Archipelago; it was edited in its early years by Nicholas Belfield Dennys, editor of the China Mail newspaper, and aimed to be similar to the previously published Notes and Queries on China and Japan",
                "categories": [
                      "Asian"
                 ],
                "imageLink": "https://m.media-amazon.com/images/I/51QXlpIfmOL._AC_UF1000,1000_QL80_.jpg",
                "price": "KSh. 3599"        
            },
    
            {
                "id": "BL0NNoFPuAQC",
                "title": "High Performance MySQL",
                "authors": [
                        "Baron Schwartz",
                        "Peter Zaitsev",
                        "Vadim Tkachenko",
                        "Jeremy D. Zawodny",
                        "Arjen Lentz",
                        "Derek J. Balling"
                    ],
                "publisher": "\"O'Reilly Media, Inc.\"",
                "publishedDate": "2008-06-18",
                "description": "High Performance MySQL is the definitive guide to building fast, reliable systems with MySQL. Written by noted experts with years of real-world experience building very large systems, this book covers every aspect of MySQL performance in detail, and focuses on robustness, security, and data integrity. High Performance MySQL teaches you advanced techniques in depth so you can bring out MySQL's full power. Learn how to design schemas, indexes, queries and advanced MySQL features for maximum performance, and get detailed guidance for tuning your MySQL server, operating system, and hardware to their fullest potential. You'll also learn practical, safe, high-performance ways to scale your applications with replication, load balancing, high availability, and failover. This second edition is completely revised and greatly expanded, with deeper coverage in all areas. Major additions include: Emphasis throughout on both performance and reliability Thorough coverage of storage engines, including in-depth tuning and optimizations for the InnoDB storage engine Effects of new features in MySQL 5.0 and 5.1, including stored procedures, partitioned databases, triggers, and views A detailed discussion on how to build very large, highly scalable systems with MySQL New options for backups and replication Optimization of advanced querying features, such as full-text searches Four new appendices The book also includes chapters on benchmarking, profiling, backups, security, and tools and techniques to help you measure, monitor, and manage your MySQL installations.",
                "categories": [
                        "Computers"
                    ],
                "imageLink": "http://books.google.com/books/content?id=BL0NNoFPuAQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
                "price": "KSh. 6342"
                   
                }
    ]
}



